##### quiz
```
local city_info 데이터베이스의 popular 테이블의 데이터를 가져와
ubuntu test 데이터베이스의 popular 테이블로 마이그레이션하는 코드를 작성
```

In [1]:
# read local city_info popular 

import MySQLdb, pickle
import pandas as pd
from sqlalchemy import create_engine

pw = pickle.load(open('pw.p','rb'))

db = MySQLdb.connect(
    "127.0.0.1",
    "root",
    pw,
    "city_info",
    charset='utf8',
)

SQL_QUERY = """
    SELECT *
    FROM popular;
"""

popular_df = pd.read_sql(SQL_QUERY, db)
popular_df

   rank city_name  popular
0     1     seoul  9904312
1     2     busan  3448737
2     3   incheon  2890451
3     4     daegu  2466052
4     5   daejeon  1538394
5     6  gwanggju  1502881

In [2]:
# write ubuntu test popular
engine = create_engine("mysql+mysqldb://root:" + pw + "@13.125.105.201/test")
popular_df.to_sql(name="popular", con=engine, if_exists='replace')